var str="克里斯-保罗" +
    "(Chris Paul)" +
    "" +
    "3G1.83米/6尺079公斤/175磅1985-05-064年1.6亿美元，2018年夏天签，2022年夏天到期" +
    "本年薪金：3565万美元" +
    " 詹姆斯-哈登" +
    "(James Harden)" +
    "" +
    "13G1.96米/6尺5100公斤/220磅1989-08-262016年夏天在旧合同期内以4年1.18亿美元提前续约至2020年，2017年夏天再次以4年1.7亿美元提前续约至2023年，2022-23赛季球员选项" +
    "本年薪金：3043万美元" +
    " 布兰登-奈特" +
    "(Brandon Knight)" +
    "" +
    "2G1.91米/6尺388公斤/195磅1991-12-025年7000万美元，2015年夏天签，2020年夏天到期" +
    "本年薪金：1463万美元" +
    " 克林特-卡佩拉" +
    "(Clint Capela)" +
    "" +
    "15C2.11米/6尺11109公斤/240磅1994-05-185年9000万美元，2018年夏天签，2023年夏天到期，其中8000万美元保障，每赛季火箭进入西决奖励100万美元，防守篮板率达到30%、罚球命中率达到65%各奖励50万美元" +
    "本年薪金：1379万美元" +
    " 埃里克-戈登" +
    "(Eric Gordon)" +
    "" +
    "10G1.93米/6尺498公斤/215磅1988-12-254年5289万美元，2016年夏天签，2020年夏天到期。" +
    "本年薪金：1350万美元" +
    " PJ-塔克" +
    "(PJ Tucker)" +
    "" +
    "17F1.98米/6尺6111公斤/245磅1985-05-054年3188万美元，2017年夏天签，2021年夏天到期，2020-21赛季257万美元保障，2020年7月1日之前不被裁则转为全额保障" +
    "本年薪金：797万美元" +
    " 内内" +
    "( Nene)" +
    "" +
    "42C-F2.11米/6尺11113公斤/250磅1982-09-133年1095万美元，2017年夏天签，2020年夏天到期" +
    "本年薪金：365万美元" +
    " 马基斯-克里斯" +
    "(Marquese Chriss)" +
    "" +
    "0F2.08米/6尺10106公斤/233磅1997-07-024年1330万美元，2016年夏天签，2020年夏天到期，2018-19赛季、2019-20赛季球队选项" +
    "本年薪金：321万美元" +
    " 杰拉德-格林" +
    "(Gerald Green)" +
    "" +
    "14G-F2.01米/6尺793公斤/205磅1986-01-261年240万美元，2018年夏天签，2019年夏天到期" +
    "本年薪金：240万美元" +
    " 卡梅罗-安东尼" +
    "(Carmelo Anthony)" +
    "" +
    "7F2.03米/6尺8109公斤/240磅1984-05-291年240万美元，2018年夏天签，2019年夏天到期" +
    "本年薪金：240万美元" +
    " 迈克尔-卡特-威廉姆斯" +
    "(Michael Carter-Williams)" +
    "" +
    "1G1.98米/6尺686公斤/190磅1991-10-101年176万美元，2018年夏天签，2019年夏天到期" +
    "本年薪金：176万美元" +
    " 詹姆斯-恩尼斯" +
    "(James Ennis III)" +
    "" +
    "8F2.01米/6尺795公斤/210磅1990-07-012年347万美元，2018年夏天签，2020年夏天到期，2019年球员选项" +
    "本年薪金：162万美元" +
    " 以赛亚-哈尔滕施泰因" +
    "(Isaiah Hartenstein)" +
    "" +
    "55F-C2.13米/7尺0113公斤/249磅1998-05-053年392万美元，2018年夏天签，2021年夏天到期" +
    "本年薪金：84万美元" +
    " 加里-克拉克" +
    "(Gary Clark)" +
    "" +
    "6F2.03米/6尺8102公斤/225磅1994-11-163年368万美元。2018年夏天签，2021年夏天到期。" +
    "本年薪金：60万美元" +
    " 文森特-爱德华兹" +
    "(Vincent Edwards)" +
    "" +
    "12F2.03米/6尺8102公斤/225磅1996-04-05双向合同" +
    "本年薪金：0万美元" +
    " 奥斯汀-里弗斯" +
    "(Austin Rivers)" +
    "" +
    "25G1.93米/6尺491公斤/200磅1992-08-01" +
    "本年薪金：万美元" +
    " 丹纽尔-豪斯" +
    "(Danuel House)" +
    "" +
    "4G2.01米/6尺798公斤/215磅1993-06-07双向合同" +
    "本年薪金：万美元";