const team=['雄鹿','鹈鹕','勇士','快船','国王','猛龙','湖人','黄蜂','奇才','雷霆','凯尔特人','马刺','开拓者','森林狼','篮网','独行侠','掘金','火箭','老鹰','爵士','尼克斯','步行者','活塞','热火','太阳','魔术','骑士','灰熊','公牛','76人'];
/*测试console.log(team[2]);*/
const spurs=['德马尔德罗赞','拉马库斯阿尔德里奇','保罗加索尔','帕蒂米尔斯','鲁迪盖伊','戴维斯贝尔坦斯','马科贝里内利','布林福布斯','雅各布珀尔特尔','丹特坎宁安','朗尼沃克','昆西庞德塞特','德里克怀特','德章泰默里','奇梅齐耶梅图','本摩尔','德鲁尤班克斯'];
const rocket=['克里斯保罗','詹姆斯哈登','布兰登奈特','内内','克林特卡佩拉','埃里克戈登','PJ塔克','马基斯克里斯','杰拉德格林','卡梅罗安东尼','迈克尔卡特威廉姆斯','詹姆斯恩尼斯','以赛亚哈尔滕施泰','加里克拉克','文森特爱德华兹','奥斯汀里弗斯','丹纽尔豪斯'];
const grizzlie=['迈克康利','马克加索尔','钱德勒帕森斯','凯尔安德森','加莱特坦普尔','杰迈克尔格林','小贾伦杰克逊','贾斯庭霍勒迪','欧米卡斯比','谢尔文麦克','乔金诺阿','狄龙布鲁克斯','伊万拉布','杰文卡特','贾内尔斯托克斯','渡边雄太'];
const mavericks=['哈里森巴恩斯','德安德烈乔丹','韦斯利马修斯','德怀特鲍威尔','卢卡东契奇','德克诺维斯基','丹尼斯史密斯','何塞巴里亚','德文哈里斯','萨拉赫梅杰里','马克西克勒贝尔','杰伦杰伦森','多里安芬尼史密斯','瑞安布罗科夫','达里尔梅肯','科斯塔斯阿德托昆博'];
const pelican=['朱霍勒迪','安东尼戴维斯','尼古拉米罗蒂奇','所罗门希尔','所罗门希尔','伊托万摩尔','朱利叶斯兰德尔','韦斯利约翰逊','埃尔弗里德佩顿','达柳斯米勒','伊恩克拉克','蒂姆弗雷泽','贾利尔奥卡福','谢赫迪亚洛','弗兰克杰克逊','肯里奇威廉姆斯','安德鲁哈里森','特雷旺布卢伊特'];
const warriors=['斯蒂芬库里','凯文杜兰特','克莱汤普森','德雷蒙德格林','安德烈伊格达拉','肖恩利文斯顿','德马库斯考辛斯','约纳斯杰雷布科','雅各布埃文斯','凯文卢尼','奎因库克','乔丹贝尔','阿方索麦金尼','达米安琼斯','马库斯德里克森','达米恩李'];
const clippers=['达尼罗加里纳利','托拜厄斯哈里斯','马尔钦戈塔特','埃弗里布拉德利','路易斯威廉姆斯','博班马里亚诺维奇','米洛什特奥多西奇','蒙特雷兹哈勒尔','帕特里克贝弗利','卢克理查德巴莫特','迈克斯科特','谢伊吉尔杰斯亚历山大','杰罗姆罗宾逊','辛达里厄斯桑韦尔','蒂龙华莱士','乔纳森莫特利','安吉尔德尔加多'];
const lakers=['勒布朗詹姆斯','肯塔维厄斯考德威尔波普','拉简隆多','朗佐鲍尔','布兰登英格拉姆','兰斯史蒂芬森','迈克尔比斯利','贾维尔麦基','泰森钱德勒','莫里茨瓦格纳','凯尔库兹马','约什哈特','斯维亚托斯拉夫米哈伊柳克','伊维察祖巴茨','伊萨克邦加','乔纳森威廉姆斯','亚历克斯卡鲁索'];
const king=['扎克兰多夫','伊曼香珀特','波格丹波格丹诺维奇','科斯塔库佛斯','马文巴格利','内马尼亚别利察','达龙福克斯','本麦克勒摩','威利考利斯坦','巴迪希尔德','约吉费雷尔','贾斯廷杰克逊','哈里贾尔斯','弗兰克梅森','斯卡尔拉比西埃','韦尼恩加布里埃尔','特洛伊威廉姆斯'];
const sun=['莱恩安德森','TJ沃伦','德安德烈艾顿','约什杰克逊','德拉甘本德尔','米卡尔布里奇斯','特洛伊丹尼尔斯','德文布克','凯利乌布雷','贾马尔克劳福德','里乔恩霍姆斯','埃利奥科博','丹东尼梅尔顿','贾旺埃文斯','乔治金'];
const nuggets=['保罗米尔萨普','尼古拉约基奇','加里哈里斯','梅森普拉姆利','威尔巴顿','贾马尔默里','特雷莱尔斯','迈克尔波特','胡安埃尔南戈麦斯','以赛亚托马斯','托里克雷格','泰勒莱登','马利克比斯利','蒙特莫里斯','贾里德范德比尔特','布兰登古德温','托马斯韦尔什'];
const thunder=['拉塞尔维斯布鲁克','保罗乔治','史蒂文亚当斯','丹尼斯施罗德','安德烈罗伯森','杰拉米格兰特','亚历克斯阿夫里内斯','帕特里克帕特森','雷蒙德菲尔顿','特伦斯弗格森','纳伦斯诺埃尔','蒂莫泰卢瓦乌卡巴罗','阿卜杜勒纳迪尔','哈米杜迪亚洛','德翁特伯顿','唐特格兰瑟姆'];
const blazers=['达米安利拉德','CJ麦科勒姆','埃文特纳','优素福努尔基奇','迈耶斯伦纳德','莫里斯哈克利斯','艾尔法鲁克阿米奴','扎克科林斯','塞思库里','安芬尼西蒙斯','凯莱布斯瓦尼根','尼克斯陶斯卡斯','韦德鲍德温','杰克莱曼','小加里特伦特'];
const jazz=['鲁迪戈贝尔','德里克费沃斯','里基卢比奥','乔英格尔斯','丹特埃克萨姆','凯尔科沃尔','杰克劳德','萨博塞福洛沙','艾派尤度','多诺万米切尔','劳尔内托','格雷森阿伦','托尼布拉德利','乔治尼昂','罗伊斯奥尼尔','纳兹米特鲁朗','泰勒卡瓦诺'];
const timberwolves=['安德鲁威金斯','杰夫蒂格','戈尔吉吉昂','泰吉布森','罗伯特科温顿','杰里贝勒斯','卡尔安东尼唐斯','安东尼托利弗','达里奥沙里奇','泰厄斯琼斯','洛尔邓','德里克罗斯','约什奥科吉','詹姆斯农纳利','凯塔贝茨迪奥普','杰瑞特雷尔','CJ威廉姆斯'];
const raptors=['凯尔洛瑞','赛尔吉伊巴卡','科怀伦纳德','约纳斯瓦兰丘纳斯','丹尼格林','诺曼鲍威尔','弗雷德范弗利特','CJ迈尔斯','德朗赖特','格雷格门罗','OG阿奴诺比','洛伦佐布朗','马拉奇理查德森','帕斯卡尔西亚卡姆','克里斯布歇','乔丹劳埃德'];
const sixers=['乔尔恩比德','吉米巴特勒','威尔森钱德勒','JJ雷迪克','马克尔富尔茨','本西蒙斯','迈克穆斯卡拉','贾斯廷巴顿','扎伊尔史密斯','阿米尔约翰逊','兰德里沙梅特','乔纳博尔登','TJ麦康奈尔','富尔坎科尔克马兹','迪米特里厄斯杰克逊','谢克米尔顿'];
const celtics=['戈登海沃德','艾尔霍弗德','凯里欧文','马库斯斯马特','杰森塔特姆','马库斯莫里斯','阿隆贝恩斯','杰伦布朗','特里罗齐尔','盖尔雄亚布塞莱','罗伯特威廉姆斯','丹尼尔泰斯','谢米奥杰莱','贾巴里伯德','布拉德沃纳梅克','PJ多齐尔'];
const nets=['阿伦克拉布','德马雷卡罗尔','肯尼思法里德','贾里德杜德利','乔哈里斯','丹吉洛拉塞尔','埃德戴维斯','朗戴霍利斯杰弗森','贾莱特阿伦','沙巴兹内皮尔','卡里斯勒韦尔','斯潘塞丁威迪','扎南穆萨','罗季翁斯库鲁茨','特雷韦恩格雷厄姆','西奥平森'];
const nicks=['埃内斯坎特','小蒂姆哈达威','考特尼李','兰斯托马斯','马里奥海佐尼亚','克里斯塔普斯波尔津吉斯','伊曼纽尔穆迪埃','弗朗克尼利基纳','凯文诺克斯','阿朗佐特里尔','特雷伯克','卢克科内特','丹伊恩多特森','诺阿冯莱','米切尔罗宾逊','以赛亚希克斯'];
const heat=['哈桑怀特塞德','泰勒约翰逊','戈兰德拉季奇','詹姆斯约翰逊','迪昂韦特斯','凯利奥利尼克','约什理查德森','韦恩艾灵顿','贾斯蒂斯温斯洛','巴姆阿德巴约','德维恩韦德','犹多尼斯哈斯勒姆','小德里克琼斯','罗德尼麦格鲁德','亚特马滕','邓肯鲁宾逊'];
const hornets=['尼古拉斯巴图姆','俾斯麦比永博','马文威廉姆斯','科迪泽勒','迈克尔基德吉尔克里斯特','肯巴沃克','杰里米兰姆','托尼帕克','弗兰克卡明斯基','马利克蒙克','迈尔斯布里奇斯','吉列尔莫埃尔南戈麦斯','德维恩培根','德文特格雷厄姆','乔奇利','JP马楚拉'];
const magic=['阿龙戈登','埃文富尼耶','季莫费莫兹戈夫','尼古拉武切维奇','特伦斯罗斯','DJ奥古斯丁','乔纳森西蒙斯','乔纳森艾萨克','穆罕默德班巴','杰里安格兰特','贾雷尔马丁','肯伯奇','韦斯利艾旺杜','梅尔文弗雷泽','以赛亚布里斯科','阿米尔杰弗森','特洛伊科佩恩'];
const wizards=['奥托波特','布拉德利比尔','约翰沃尔','伊安马辛米','特雷沃阿里扎','马基夫莫里斯','德怀特霍华德','托马什萨托兰斯基','萨姆德克尔','特洛伊布朗','杰夫格林','托马斯布莱恩特','德文罗宾逊','罗恩贝克','沙松兰德尔','乔丹麦克雷'];
const eagle=['肯特贝兹莫尔','林书豪','迈尔斯普拉姆利','德维恩戴德蒙','特雷杨','亚历克斯莱恩','托里恩普林斯','贾斯廷安德森','文斯卡特','约翰科林斯','凯文赫尔特','德安德烈本布里','奥马里斯佩尔曼','泰勒多西','丹尼尔汉密尔顿','杰伦亚当斯','亚历克斯波伊思雷斯'];
const bucks=['扬尼斯阿德托昆博','乔治希尔','埃里克布莱索','克里斯米德尔顿','托尼斯内尔','艾森伊利亚索瓦','杰森史密斯','布鲁克洛佩斯','索恩梅克','DJ威尔森','唐特迪温琴佐','帕特康诺顿','马尔科姆布罗格登','克里斯蒂安伍德','斯特林布朗','杰伦莫里斯','特雷旺杜瓦尔'];
const pacers=['维克托奥拉迪波','赛迪斯杨','泰瑞克埃文斯','博扬波格丹诺维奇','达伦科里森','科里约瑟夫','道格麦克德莫特','凯尔奥奎因','迈尔斯特纳','多曼塔斯萨博尼斯','TJ利夫','阿龙霍勒迪','伊凯阿尼博古','阿利兹约翰逊','埃德蒙萨姆纳','达文里德'];
const piston=['布雷克格里芬','安德烈德拉蒙德','雷吉杰克逊','乔恩洛伊尔','兰斯顿加洛韦','伊斯梅尔史密斯','格伦罗宾逊三世','斯坦利约翰逊','卢克肯纳德','雷吉布洛克','何塞卡尔德隆','扎扎帕楚里亚','亨利埃伦森','布鲁斯布朗','凯里托马斯','扎克洛夫顿','基南埃文斯'];
const bull=['贾巴里帕克','扎克拉文','罗宾洛佩斯','克里斯蒂亚诺费利西奥','劳里马尔卡宁','温德尔卡特','克里斯邓恩','博比波蒂斯','登泽尔瓦伦丁','钱德勒哈奇森','马尚布鲁克斯','韦恩塞尔登','安东尼奥布莱克尼','瑞安阿西迪亚科诺','沙奎尔哈里森','布兰登桑普森','罗尔阿尔金斯','小拉里南斯','安特日日奇','大卫努瓦巴','杰伦琼斯','杰朗布洛瑟姆盖姆','帕特里克麦考'];
const knight=['凯文乐福','特里斯坦汤普森','JR史密斯','乔丹克拉克森','亚历克伯克斯','约翰亨森','马修戴拉维多瓦','科林塞克斯顿','罗德尼胡德','切迪奥斯曼','钱宁弗莱',,];
var R=[];
R[bucks]={
    name:team[0],
    coach:"迈克布登霍尔泽",
    mates:bucks
};
R[pelican]={
    name:team[1],
    coach:"阿尔文金特里",
    mates:pelican
};
R[warriors]={
    name:team[2],
    coach:"史蒂夫科尔",
    mates:warriors
};
R[clippers]={
    name:"快船",
    coach:"道哥里弗斯",
    mates:clippers
};
R[king]={
    name:"国王",
    coach:"戴夫乔尔格",
    mates:king
};
R[raptors]={
    name:"猛龙",
    coach:"尼克纳斯",
    mates:raptors
};
R[lakers]={
    name:"湖人",
    coach:"卢克沃顿",
    mates:lakers
};
R[hornets]={
    name:"黄蜂",
    coach:"詹姆斯-博雷戈",
    mates:hornets
};
R[wizards]={
    name:"奇才",
    coach:"詹姆斯-博雷戈",
    mates:wizards
};
R[thunder]={
    name:"雷霆",
    coach:"比利多诺万",
    mates:thunder
};
R[celtics]={
    name:"凯尔特人",
    coach:"肖恩史蒂文森",
    mates:celtics
};
R[spurs]={
    name:"马刺",
    coach:"格雷格波波维奇",
    mates:spurs
};
R[blazers]={
    name:"开拓者",
    coach:"特里斯托茨",
    mates:blazers
};
R[timberwolves]={
    name:"森林狼",
    coach:"汤姆锡伯杜",
    mates:timberwolves
};
R[nets]={
    name:"篮网",
    coach:"肯尼阿特金森",
    mates:nets
};
R[mavericks]={
    name:"独行侠",
    coach:"里克卡莱尔",
    mates:mavericks
};
R[nuggets]={
    name:"掘金",
    coach:"迈克尔马龙",
    mates:nuggets
};
R[rocket]={
    name:"火箭",
    coach:"迈克德安东尼",
    mates:rocket
};
R[eagle]={
    name:"老鹰",
    coach:"劳埃德皮尔斯",
    mates:eagle
};
R[jazz]={
    name:"爵士",
    coach:"",
    mates:eagle
};
R[nicks]={
    name:"尼克斯",
    coach:"大卫菲兹代尔",
    mates:nicks
};
R[pacers]={
    name:"步行者",
    coach:"内特麦克米兰",
    mates:pacers
};
R[piston]={
    name:"活塞",
    coach:"德韦恩凯西",
    mates:piston
};
R[heat]={
    name:"热火",
    coach:"埃里克斯波尔斯特拉",
    mates:heat
};
R[sun]={
    name:"太阳",
    coach:"伊戈尔科科什科夫",
    mates:sun
};
R[sun]={
    name:"太阳",
    coach:"伊戈尔科科什科夫",
    mates:sun
};
R[magic]={
    name:"魔术",
    coach:"史蒂夫-克利福德",
    mates:magic
};
R[knight]={
    name:"骑士",
    coach:"拉里德鲁",
    mates:knight
};
R[grizzlie]={
    name:"灰熊",
    coach:"JB比克斯塔夫",
    mates:grizzlie
};
R[bull]={
    name:"公牛",
    coach:"弗雷德霍伊博格",
    mates:bull
};
R[sixers]={
    name:"76人",
    coach:"布雷特-布朗",
    mates:sixers
}
